[
    {
        "trail_name": "Tamolitch Blue Pool via McKenzie River Trail",
        "length": "3.6 Miles",
        "description": "Tamolitch Blue Pool via McKenzie River Trail is a 3.6 mile heavily trafficked out and back trail located near Blue River, Oregon that features a waterfall and is rated as moderate. The trail offers a number of activity options and is accessible year-round. Dogs are also able to use this trail but must be kept on leash."
    },
    {
        "trail_name": "Tamanawas Falls Trail",
        "length": "3.4 Miles",
        "description": "Tamanawas is an impressive 150' waterfall with easy access from Rt. 35. It's a shady hike through Douglas Firs and Cedars with a dry cave to explore behind the falls. This easy trail in the Mt Hood National Forest has a journey just as lovely as the destination. The hike follows closely along the banks of Cold Spring Creek, up through a massive boulder field, and finally arrives at the 150ft tall Tamanawas."
    },
    {
        "trail_name": "Latourell Falls Loop Trail",
        "length": "2.1 Miles",
        "description": "A short drive from downtown Portland, Latourell Falls Loop Trail is a moderately difficult trek through Guy W. Talbot State Park to Upper Latourell Falls. This is a very popular trail to the third tallest waterfall in the Columbia Gorge. The upper falls and part of the trail are part of George W. Joseph State Natural Area, named for the family that gave the land to the state in 1934 and 1942. The trail starts at the Latourell Falls Trailhead just off the Historic Columbia River Highway. The majority of the trail’s elevation is at the beginning of the hike and certain areas can get slightly muddy and slippery so proper footwear is required. The town of Latourell borders the north side of the park. Please respect the privacy of nearby residents."
    },
    {
        "trail_name": "Angel's Rest",
        "length": "4.5 Miles",
        "description": "Angel's Rest is the perfect mix for hikers looking for moderate elevation gain, relatively short distance, and incredible reward at the summit with 360 degree views of the Columbia River Gorge and Portland's northern metro. The parking area at the trailhead is very well maintained, and is located just a short distance from I-84. Since this trailhead is very popular throughout the year, parking can be difficult past 10:00 A.M., but there is additional parking on the road located a few hundred feet west of the trailhead." 
    },
    {
        "trail_name": "Garfield Peak Trail",
        "length": "3.4 Miles",
        "description": "This is the one of the most popular hiking trails in Crater Lake National Park with close proximity to the Rim Village, Crater Lake Lodge, and Applegate Peak. There are spectacular panoramic views of the entire lake and other high cascades features to the north and to the south the Klamath Basin and southern Cascade features." 
    },
    {
        "trail_name": "Misery Ridge and River Trail",
        "length": "3.5 Miles",
        "description": "Despite the name, this is the most popular route in Smith Rock State Park! You'll get in a challenging climb, ridge views, and a nice walk along the river all in one hike." 
    }
]